{
  "projects": [
    {
      "id": 1,
      "title": "Personal Portfolio (2025)",
      "description": "Designed and implemented a fully-featured personal portfolio application to showcase professional work history, technical expertise, and creative projects. The portfolio itself serves as a living demonstration of software engineering ability—covering everything from UI design and branding to CI/CD and cloud deployment. Features include responsive design with light/dark themes, custom SVG logo design, PostHog analytics integration, and secure AWS deployment with CloudFront CDN.",
      "image": "portfolio-2.png",
      "category": "fullstack",
      "clientId": "jpkramer",
      "technologies": ["nextjs", "react", "typescript", "tailwindcss", "shadcn-ui", "svg", "aws", "s3", "cloudfront", "github-actions", "posthog", "git"],
      "liveUrl": "#",
      "githubUrl": "https://github.com/Wounded-Knee/portfolio-2025-a/",
      "featured": true,
      "dateCompleted": "January 2025"
    },
    {
      "id": 2,
      "title": "Quicken.com Website Redesign",
      "description": "Built responsive mobile-first page types and display components, reducing dependence on Wordpress and Drupal by 90%. Created product selection tools with React and Redux, increasing add-to-cart rate by 30%.",
      "image": "1.png",
      "category": "fullstack",
      "clientId": "quicken",
      "technologies": ["javascript", "html5", "css3", "sass", "react", "redux", "nodejs", "figma", "liquid", "contentful"],
      "liveUrl": "https://quicken.com",
      "githubUrl": null,
      "featured": true,
      "dateCompleted": "December 2024"
    },
    {
      "id": 3,
      "title": "Wells Fargo Check Scanning App",
      "description": "Developed check scanning mobile webapp with React, Redux, and REST APIs. Implemented accessible, responsive interfaces and robust state management with accessibility compliance.",
      "image": null,
      "category": "frontend",
      "clientId": "wells-fargo",
      "technologies": ["react", "redux", "javascript", "css3", "figma", "axios", "rest"],
      "liveUrl": "#",
      "githubUrl": null,
      "featured": false,
      "dateCompleted": "June 2022"
    },
    {
      "id": 4,
      "title": "Nuffsaid Workflow Intelligence Platform",
      "description": "Built modular UI components for Workflow Intelligence Platform. Implemented client-side state management for customer signals and integrated third-party data from Gmail, Salesforce, and Slack.",
      "image": "wip-2.png",
      "category": "frontend",
      "clientId": "nuffsaid",
      "technologies": ["react", "redux", "typescript", "css3", "jest", "figma", "rest"],
      "liveUrl": "#",
      "githubUrl": null,
      "featured": false,
      "dateCompleted": "June 2021"
    },
    {
      "id": 5,
      "title": "LinkedIn Recruiter",
      "description": "Provided front-end development for the LinkedIn hiring platform. Handled trouble tickets, developed new features, and participated in on-call rotations supporting the product.",
      "image": "recruiter-1.png",
      "category": "frontend",
      "clientId": "linkedin",
      "technologies": ["html5", "css3", "javascript", "emberjs", "spa", "scrum"],
      "liveUrl": "#",
      "githubUrl": null,
      "featured": false,
      "dateCompleted": "September 2020"
    },
    {
      "id": 6,
      "title": "LinkedIn HireIn Legacy System",
      "description": "Provided front-end development for the company's legacy hiring system, HireIn. Fielded service requests from other divisions and provided user support.",
      "image": null,
      "category": "frontend",
      "clientId": "linkedin",
      "technologies": ["html5", "css3", "javascript", "emberjs", "spa", "scrum", "nodejs"],
      "liveUrl": "#",
      "githubUrl": null,
      "featured": false,
      "dateCompleted": "January 2019"
    },
    {
      "id": 7,
      "title": "D³ Social Media Platform",
      "description": "Performed design & development for a personal research project conceiving a next-generation social media platform, code named D³.",
      "image": null,
      "category": "fullstack",
      "clientId": "jpkramer",
      "technologies": ["html5", "css3", "javascript", "react", "nextjs", "spa", "nodejs"],
      "liveUrl": "#",
      "githubUrl": null,
      "featured": false,
      "dateCompleted": "January 2018"
    },
    {
      "id": 8,
      "title": "Rubicon Advertising Marketplace",
      "description": "Worked on the Rubicon advertising marketplace application. Received functionality requirements from designers and produced JavaScript components. Participated in design review meetings.",
      "image": "49bc-1.png",
      "category": "frontend",
      "clientId": "rubicon-project",
      "technologies": ["html5", "css3", "javascript", "react", "jquery", "spa", "scrum", "nodejs"],
      "liveUrl": "#",
      "githubUrl": null,
      "featured": false,
      "dateCompleted": "November 2016"
    },
    {
      "id": 9,
      "title": "Rosetta Responsive Web Properties",
      "description": "Received screen mockups from designers and produced pixel-perfect HTML/CSS. Implemented responsive design requirements for mobile/tablet user-agents. Produced JavaScript components and mentored junior developers.",
      "image": null,
      "category": "frontend",
      "clientId": "rosetta",
      "technologies": ["html5", "css3", "javascript", "jquery", "scrum", "responsive"],
      "liveUrl": "#",
      "githubUrl": null,
      "featured": false,
      "dateCompleted": "July 2013"
    },
    {
      "id": 10,
      "title": "Yahoo! APT Advertising Platform",
      "description": "Performed various maintenance and development tasks related to the company's advertising platform, APT. Investigated and documented user experience problems and developed solutions to them.",
      "image": "apt-1.png",
      "category": "frontend",
      "clientId": "yahoo",
      "technologies": ["html5", "css3", "javascript", "yui", "spa", "scrum"],
      "liveUrl": "#",
      "githubUrl": null,
      "featured": false,
      "dateCompleted": "April 2012"
    },
    {
      "id": 11,
      "title": "Nokia Ovi Organizer",
      "description": "Received feature requirements and delivered front-end code solutions as part of the Ovi Organizer team.",
      "image": "ovi-1.webp",
      "category": "frontend",
      "clientId": "nokia",
      "technologies": ["xhtml", "css2", "javascript", "jquery", "spa", "scrum"],
      "liveUrl": "#",
      "githubUrl": null,
      "featured": false,
      "dateCompleted": "April 2010"
    },
    {
      "id": 12,
      "title": "Rooftop Media Web Properties",
      "description": "Led the front-end design and development of several web properties, including SucksBox, 2009 National College Comedy Competition, rooftopmedia.net, and rooftopcomedy.com.",
      "image": "rooftop-media-1.png",
      "category": "frontend",
      "clientId": "rooftop-media",
      "technologies": ["xhtml", "css2", "javascript", "jquery", "yui"],
      "liveUrl": "#",
      "githubUrl": null,
      "featured": false,
      "dateCompleted": "October 2009"
    },
    {
      "id": 13,
      "title": "Solution Set Component Library",
      "description": "Received screen mockups from designers and produced pixel-perfect HTML/CSS. Produced JavaScript components and participated in design review meetings. Maintained a JavaScript component library for internal use.",
      "image": null,
      "category": "frontend",
      "clientId": "solution-set",
      "technologies": ["xhtml", "css2", "javascript", "prototypejs"],
      "liveUrl": "#",
      "githubUrl": null,
      "featured": false,
      "dateCompleted": "October 2008"
    },
    {
      "id": 14,
      "title": "Ooma Lounge",
      "description": "Developed a customer-facing web portal that allowed Ooma users to manage their VoIP phone service, including voicemail, call logs, and account settings. Implemented pixel-perfect designs and integrated with backend services.",
      "image": "ooma-lounge-1.webm",
      "category": "frontend",
      "clientId": "solution-set",
      "technologies": ["html5", "css3", "javascript"],
      "dateCompleted": "October 2008",
      "caseStudy": {
        "situation": ["Ooma, a Palo Alto telecommunications start-up, was preparing to launch their hardware product and needed a customer-facing web portal—the Ooma Lounge—to match the sleek design and innovative nature of their device. Their internal staff was fully occupied with hardware and backend development, so they engaged an agency team to deliver a complete front-end implementation."],
        "task": ["As one of the lead front-end developer on the agency team, my responsibility was to translate the creative agency's designs into a fully functional, browser-based interface. The portal needed to provide Ooma users with access to voicemail, call logs, system settings, and account management. A critical requirement was ensuring seamless integration between the front-end user flows (registration, number selection, preferences) and Ooma's backend provisioning systems."],
        "action": [
          "<ul>",
          "<li>Implemented the provided Web 2.0 designs using XHTML/CSS for structure and styling</li>",
          "<li>Built interactive components in JavaScript to support features like visual voicemail, call log filtering, and preferences management.</li>",
          "<li>Collaborated with backend engineers to integrate the registration flow, which allowed users to either port an existing phone number or select one from Ooma's predefined pool</li>",
          "<li>Ensured the front-end communicated correctly with backend services via SOAP/XML, working closely with QA to validate data flows (account provisioning, call records, voicemail sync)</li>",
          "<li>Optimized the UI for usability and consistency so that the customer experience of the Lounge reflected the premium feel of Ooma's hardware</li>",
          "</ul>"
        ],
        "result": [
          "The Ooma Lounge successfully launched in parallel with Ooma's hardware, giving customers a polished, web-based control center for their phone service. The portal allowed users to:",
          "<ul>",
          "<li>Listen to voicemail and manage messages remotely.</li>",
          "<li>Access detailed call logs.</li>",
          "<li>Configure calling preferences and account settings.</li>",
          "<li>Register devices and set up service with minimal friction.</li>",
          "</ul>",
          "This launch-ready interface helped position Ooma as an innovator in consumer telephony, supported large-scale adoption of their hardware, and demonstrated how thoughtful front-end engineering could bring brand identity and backend functionality together in a seamless user experience."
        ]
      }
    },
    {
      "id": 15,
      "title": "Autodesk Manufacturing Community",
      "description": "Developed a professional community platform for Autodesk's manufacturing users to share ideas, tips, and techniques. Built on Drupal with custom PHP and MovableType integration, featuring customizable homepages, discussion groups, and content feeds. Successfully launched at Autodesk's annual manufacturing conference within a three-week timeline.",
      "image": "autodesk-mfg-community-1.png",
      "category": "frontend",
      "clientId": "solution-set",
      "technologies": ["xhtml", "css", "php", "mysql", "javascript", "xml", "perl", "drupal", "movabletype"],
      "liveUrl": "#",
      "githubUrl": null,
      "featured": false,
      "dateCompleted": "October 2008",
      "caseStudy": {
        "situation": [
          "Autodesk, the world leader in 2D and 3D design software for manufacturing, building and construction, and media and entertainment markets, recognized that their employees and users possessed a wealth of valuable ideas and tools to share. With hundreds of thousands of users already utilizing Autodesk discussion forums, the company wanted to create an environment where information could flow not just from company to user, but from user to company and user to user. The challenge was to entice individuals to interact with one another in a more meaningful way, creating a platform that would make exchanging ideas rewarding, easy, and organized."
        ],
        "task": [
          "As a front-end software engineer on the SolutionSet team, I was tasked with implementing a community platform that would appeal to professionals in the manufacturing industry. The project had an extremely tight timeline—just three weeks from kickoff to Autodesk's annual manufacturing conference where they wanted to preview the beta site. The platform needed to be robust enough to handle professional users while being intuitive and engaging enough to encourage active participation and content sharing."
        ],
        "action": [
          "<ul>",
          "<li>Collaborated with the development team to implement a robust third-party foundation using Drupal, customizing features with PHP and integrating MovableType for content management</li>",
          "<li>Built custom homepage layouts with dynamic content feeds for events, news, and discussion groups, ensuring the platform felt alive and current</li>",
          "<li>Developed customizable homepage content functionality that allowed users to choose what types of information and geographic areas interested them, creating a personalized experience</li>",
          "<li>Implemented responsive XHTML/CSS layouts that maintained professional aesthetics while being accessible across different devices and browsers</li>",
          "<li>Created JavaScript components for enhanced user interactions, including dynamic content loading and real-time updates</li>",
          "<li>Integrated XML feeds and data structures to support the complex content relationships between users, discussions, and shared resources</li>",
          "<li>Worked with Perl scripts for MovableType integration and content synchronization</li>",
          "<li>Ensured the platform reflected the professional nature of the manufacturing community while encouraging user-generated content and collaboration</li>",
          "</ul>"
        ],
        "result": [
          "The Autodesk Manufacturing Community platform was successfully delivered within the three-week timeline and achieved significant results:",
          "<ul>",
          "<li>Successfully previewed the beta site at Autodesk's annual manufacturing conference, meeting the critical deadline</li>",
          "<li>Launched the live site to great success, creating a professional environment that encouraged user interaction</li>",
          "<li>Established a foundation for member-generated content that continues to grow organically</li>",
          "<li>Demonstrated the viability of community platforms for professional software users, leading to plans for additional community-themed portals</li>",
          "<li>Created a complex community environment that accurately reflected the users who would interact within it</li>",
          "</ul>",
          "The project showcased how thoughtful front-end engineering could transform a traditional company-to-user communication model into a vibrant, multi-directional community platform. The success of this implementation helped establish Autodesk as a leader in fostering user communities and set the stage for future community initiatives across their product portfolio."
        ]
      }
    },
    {
      "id": 16,
      "title": "Magellan Website & E-commerce Platform",
      "description": "Developed a comprehensive brand identity and e-commerce website for Magellan GPS, featuring dynamic content management, product catalog, and direct-to-consumer sales capabilities. Implemented responsive design with Flash animations and SQL Server backend integration.",
      "image": "magellan-1.png",
      "category": "frontend",
      "clientId": "magellan",
      "technologies": ["asp", "flash", "sqlserver", "html5", "css3", "javascript"],
      "liveUrl": "#",
      "githubUrl": null,
      "featured": false,
      "dateCompleted": "October 2008",
      "caseStudy": {
        "situation": [
          "Magellan, one of the world's leading developers and manufacturers of positioning, navigation, and guidance equipment, was undergoing significant company changes and needed to carve out a new identity while solidifying their web presence. With operations throughout the U.S. and Europe, they required a more dynamic website and a means to connect potential customers to their wide range of global positioning systems, both online and offline. SolutionSet had nurtured a relationship with Magellan since 2001, when the company needed to re-establish its brand and generate consumer awareness."
        ],
        "task": [
          "As a front-end software engineer on the SolutionSet team, I was tasked with implementing a cohesive internet program that would position Magellan as a market leader for GPS solutions. The project required developing a dynamic web infrastructure that the client could administer through a content management system backend, while also launching an e-commerce store to provide a direct-to-consumer sales channel. The solution needed to showcase Magellan's brand identity while generating a new revenue stream and supporting their evolving business needs."
        ],
        "action": [
          "<ul>",
          "<li>Collaborated with the development team to implement a comprehensive internet program plan documenting product lifecycle, best practices, budget, and resources necessary for Magellan's internet information systems</li>",
          "<li>Built a dynamic web infrastructure using ASP (Active Server Pages) for server-side functionality and database integration with SQL Server</li>",
          "<li>Developed a content management system backend that allowed Magellan's internal team to administer and update website content without technical assistance</li>",
          "<li>Implemented Flash animations and interactive elements to create engaging user experiences that reflected Magellan's innovative brand positioning</li>",
          "<li>Designed and built an e-commerce store with product catalog, shopping cart functionality, and secure payment processing to enable direct-to-consumer sales</li>",
          "<li>Created responsive HTML/CSS layouts that maintained brand consistency across different devices and browsers</li>",
          "<li>Integrated JavaScript components for enhanced user interactions, including product filtering, search functionality, and dynamic content loading</li>",
          "<li>Ensured seamless integration between the front-end user interface and backend database systems for product information and order management</li>",
          "<li>Implemented best practices for SEO, accessibility, and performance optimization to maximize online visibility and user experience</li>",
          "</ul>"
        ],
        "result": [
          "The Magellan website and e-commerce platform successfully transformed their online presence and business operations, achieving significant results:",
          "<ul>",
          "<li>Magellan realized a 25% increase in direct-to-consumer sales in their first year of operation</li>",
          "<li>The e-commerce store experienced 50% growth year after year, establishing a substantial new revenue stream</li>",
          "<li>Successfully positioned Magellan as a market leader for GPS solutions through enhanced brand identity and professional web presence</li>",
          "<li>Created a cost-effective, full-service branding and web package that supported Magellan's ongoing evolution as a company</li>",
          "<li>Established a scalable platform that could grow with Magellan's expanding product portfolio and business needs</li>",
          "</ul>",
          "The project demonstrated how thoughtful front-end engineering could transform a traditional manufacturing company's digital presence into a revenue-generating, brand-building platform. The success of this implementation helped establish Magellan as a leader in both GPS technology and digital commerce, setting the foundation for their continued growth in the consumer electronics market."
        ]
      }
    },
    {
      "id": 17,
      "title": "SucksBox.com",
      "description": "",
      "image": "SucksBox-1.webm",
      "category": "frontend",
      "clientId": "rooftop-media",
      "technologies": ["html5", "css3", "javascript"],
      "liveUrl": "#",
      "githubUrl": null,
      "featured": false,
      "dateCompleted": "October 2009"
    },
    {
      "id": 18,
      "title": "Yahoo! Sales Portal",
      "description": "Built a custom document library management system for Yahoo!'s internal sales team, enabling users to create, organize, and share sales materials with advanced search, bookmarks, and content management features.",
      "image": "ysp-2.png",
      "category": "frontend",
      "clientId": "solution-set",
      "technologies": ["xhtml", "css", "javascript", "ajax", "php", "rss"],
      "liveUrl": "#",
      "githubUrl": null,
      "featured": false,
      "dateCompleted": "October 2008",
      "caseStudy": {
        "situation": [
          "Yahoo! Sales Team, responsible for advertising and marketing activities across Yahoo!'s diverse web properties, was struggling with an outdated internal document application. Their existing system was slow and required a cumbersome multi-step process for adding new sales documents, involving emailing content to a gatekeeper who would manually upload files. This process led to stale, outdated content and difficulty in adding new users to alleviate the gatekeeper's workload."
        ],
        "task": [
          "As part of the SolutionSet development team, I was tasked with building a custom document library system that would eliminate the need for gatekeepers, streamline document sharing, and provide Yahoo!'s sales team with an efficient way to create, organize, and distribute sales materials. The system needed to integrate with Yahoo!'s Oracle database and work within their strict security environment."
        ],
        "action": [
          "<ul>",
          "<li>Collaborated with Yahoo!'s internal teams to establish rapport and understand data sharing requirements across departments</li>",
          "<li>Worked closely with Yahoo!'s network team to set up a secure development environment limited to their Oracle database and specially branded PHP version</li>",
          "<li>Built a custom application framework based on designs and information architecture provided by Method</li>",
          "<li>Implemented a unified admin system for uploading and posting documents, eliminating the need for gatekeepers</li>",
          "<li>Developed full-text search functionality and bookmarking system for easy document discovery</li>",
          "<li>Created AJAX-powered dialog boxes for quick saves and improved user experience</li>",
          "<li>Integrated RSS feeds for content updates and centralized homepage data aggregation</li>",
          "<li>Added advanced features including automatic document deletion, email status updates, group downloads, content management system, events calendar, and comprehensive reporting tools</li>",
          "</ul>"
        ],
        "result": [
          "The Yahoo! Sales Portal successfully transformed the sales team's document management workflow, resulting in:",
          "<ul>",
          "<li>Elimination of gatekeeper bottlenecks through self-service document uploads</li>",
          "<li>Improved content freshness and accessibility through streamlined processes</li>",
          "<li>Enhanced user experience with AJAX-powered interactions and centralized data access</li>",
          "<li>Comprehensive reporting capabilities including search analytics and download statistics</li>",
          "<li>Scalable system that grew with the sales team's evolving needs</li>",
          "</ul>",
          "Yahoo! was so impressed with the initial launch that they commissioned additional extensions, demonstrating the system's effectiveness and adaptability to their business requirements."
        ]
      }
    }
  ]
}
